Strefa35/esp-platform/sdkconfig.defaults.esp32s3.debug
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_MAIN_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_MGR_CTRL_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_ETH_CTRL_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_ETH_CTRL_USE_SPI_ETHERNET=y
CONFIG_ETH_CTRL_SPI_SCLK_GPIO=13
CONFIG_ETH_CTRL_SPI_MISO_GPIO=12
CONFIG_ETH_CTRL_SPI_CS0_GPIO=14
CONFIG_ETH_CTRL_SPI_INT0_GPIO=10
CONFIG_ETH_CTRL_SPI_PHY_RST0_GPIO=9
CONFIG_MQTT_CTRL_BROKER_URL="mqtt://10.0.0.10:1883"
CONFIG_MQTT_CTRL_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_RELAY_CTRL_ENABLE=n
CONFIG_RELAY_CTRL_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_SYS_CTRL_ENABLE=y
CONFIG_SYS_CTRL_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_SENSOR_CTRL_ENABLE=y
CONFIG_SENSOR_CTRL_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_SENSOR_TSL2561_ENABLE=y
CONFIG_SENSOR_TSL2561_LOG_DEFAULT_LEVEL_VERBOSE=y
CONFIG_TEMPLATE_CTRL_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM=y
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_TSL2561_LOG_DEFAULT_LEVEL_WARN=y
